oh-my-fish/plugin-sudope
fisherman/fzf
rominf/omf-plugin-hub
oh-my-fish/plugin-grc
oh-my-fish/plugin-node-binpath
oh-my-fish/plugin-bak
oh-my-fish/plugin-node
oh-my-fish/plugin-replace
Brettm12345/pure
jorgebucaran/fish-spin
franciscolourenco/done
brigand/fast-nvm-fish
evanlucas/fish-kubectl-completions
aluxian/fish-kube-prompt
fishpkg/fish-git-util
rafaelrinaldi/pure
brettm12345/gh
