oh-my-fish/plugin-sudope
fisherman/fzf
jdxcode/gh
rominf/omf-plugin-hub
oh-my-fish/plugin-grc
oh-my-fish/plugin-node-binpath
oh-my-fish/plugin-bak
oh-my-fish/plugin-node
oh-my-fish/plugin-replace
oh-my-fish/plugin-vi-mode
rafaelrinaldi/pure
Brettm12345/pure
jorgebucaran/fish-spin
jethrokuan/z
franciscolourenco/done
